eval/results/soak_stage_b_attempt7_evidence/k6-live.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: C:\Users\DARKR\AppData\Local\Temp\pf-eval-8f8d386a11b0743c-2mi5zbyz\replay.js
        output: -

     scenarios: (100.00%) 8 scenarios, 8000 max VUs, 1h0m40s max duration (incl. graceful stop):
              * tenant_t00: Up to 94.00 iterations/s for 1h0m10s over 361 stages (maxVUs: 400-1000, gracefulStop: 30s)
              * tenant_t01: Up to 94.00 iterations/s for 1h0m10s over 361 stages (maxVUs: 400-1000, gracefulStop: 30s)
              * tenant_t02: Up to 94.00 iterations/s for 1h0m10s over 361 stages (maxVUs: 400-1000, gracefulStop: 30s)
              * tenant_t03: Up to 94.00 iterations/s for 1h0m10s over 361 stages (maxVUs: 400-1000, gracefulStop: 30s)
              * tenant_t04: Up to 94.00 iterations/s for 1h0m10s over 361 stages (maxVUs: 400-1000, gracefulStop: 30s)
              * tenant_t05: Up to 94.00 iterations/s for 1h0m10s over 361 stages (maxVUs: 400-1000, gracefulStop: 30s)
              * tenant_t06: Up to 94.00 iterations/s for 1h0m10s over 361 stages (maxVUs: 400-1000, gracefulStop: 30s)
              * tenant_t07: Up to 94.00 iterations/s for 1h0m10s over 361 stages (maxVUs: 400-1000, gracefulStop: 30s)


Init         [  39% ] 1254/3200 VUs initialized
tenant_t00   [   0% ]
tenant_t01   [   0% ]
tenant_t02   [   0% ]
tenant_t03   [   0% ]
tenant_t04   [   0% ]
tenant_t05   [   0% ]
tenant_t06   [   0% ]
tenant_t07   [   0% ]

Init         [  55% ] 1750/3200 VUs initialized
tenant_t00   [   0% ]
tenant_t01   [   0% ]
tenant_t02   [   0% ]
tenant_t03   [   0% ]
tenant_t04   [   0% ]
tenant_t05   [   0% ]
tenant_t06   [   0% ]
tenant_t07   [   0% ]

Init         [  71% ] 2280/3200 VUs initialized
tenant_t00   [   0% ]
tenant_t01   [   0% ]
tenant_t02   [   0% ]
tenant_t03   [   0% ]
tenant_t04   [   0% ]
tenant_t05   [   0% ]
tenant_t06   [   0% ]
tenant_t07   [   0% ]

Init         [  84% ] 2677/3200 VUs initialized
tenant_t00   [   0% ]
tenant_t01   [   0% ]
tenant_t02   [   0% ]
tenant_t03   [   0% ]
tenant_t04   [   0% ]
tenant_t05   [   0% ]
tenant_t06   [   0% ]
tenant_t07   [   0% ]

Init         [  99% ] 3157/3200 VUs initialized
tenant_t00   [   0% ]
tenant_t01   [   0% ]
tenant_t02   [   0% ]
tenant_t03   [   0% ]
tenant_t04   [   0% ]
tenant_t05   [   0% ]
tenant_t06   [   0% ]
tenant_t07   [   0% ]

running (0h00m00.8s), 0285/3200 VUs, 41 complete and 0 interrupted iterations
tenant_t00   [   0% ] 0053/0400 VUs  0h00m00.7s/1h0m10s  94.00 iters/s
tenant_t01   [   0% ] 0052/0400 VUs  0h00m00.7s/1h0m10s  94.00 iters/s
tenant_t02   [   0% ] 0055/0400 VUs  0h00m00.7s/1h0m10s  94.00 iters/s
tenant_t03   [   0% ] 0053/0400 VUs  0h00m00.7s/1h0m10s  94.00 iters/s
tenant_t04   [   0% ] 0006/0400 VUs  0h00m00.7s/1h0m10s  09.00 iters/s
tenant_t05   [   0% ] 0006/0400 VUs  0h00m00.7s/1h0m10s  09.00 iters/s
tenant_t06   [   0% ] 0006/0400 VUs  0h00m00.7s/1h0m10s  09.00 iters/s
tenant_t07   [   0% ] 0054/0400 VUs  0h00m00.7s/1h0m10s  94.00 iters/s

running (0h00m01.9s), 0819/3200 VUs, 83 complete and 0 interrupted iterations
tenant_t00   [   0% ] 0155/0400 VUs  0h00m01.9s/1h0m10s  94.00 iters/s
tenant_t01   [   0% ] 0152/0400 VUs  0h00m01.8s/1h0m10s  94.00 iters/s
tenant_t02   [   0% ] 0156/0400 VUs  0h00m01.9s/1h0m10s  94.00 iters/s
tenant_t03   [   0% ] 0155/0400 VUs  0h00m01.9s/1h0m10s  94.00 iters/s
tenant_t04   [   0% ] 0016/0400 VUs  0h00m01.9s/1h0m10s  09.00 iters/s
tenant_t05   [   0% ] 0015/0400 VUs  0h00m01.9s/1h0m10s  09.00 iters/s
tenant_t06   [   0% ] 0014/0400 VUs  0h00m01.9s/1h0m10s  09.00 iters/s
tenant_t07   [   0% ] 0156/0400 VUs  0h00m01.9s/1h0m10s  94.00 iters/s

running (0h00m02.8s), 1016/3200 VUs, 118 complete and 0 interrupted iterations
tenant_t00   [   0% ] 0187/0400 VUs  0h00m02.7s/1h0m10s  94.00 iters/s
tenant_t01   [   0% ] 0171/0400 VUs  0h00m02.7s/1h0m10s  94.00 iters/s
tenant_t02   [   0% ] 0194/0400 VUs  0h00m02.8s/1h0m10s  94.00 iters/s
tenant_t03   [   0% ] 0206/0400 VUs  0h00m02.8s/1h0m10s  94.00 iters/s
tenant_t04   [   0% ] 0020/0400 VUs  0h00m02.8s/1h0m10s  09.00 iters/s
tenant_t05   [   0% ] 0020/0400 VUs  0h00m02.8s/1h0m10s  09.00 iters/s
tenant_t06   [   0% ] 0019/0400 VUs  0h00m02.8s/1h0m10s  09.00 iters/s
tenant_t07   [   0% ] 0199/0400 VUs  0h00m02.8s/1h0m10s  94.00 iters/s

running (0h00m03.9s), 1673/3200 VUs, 127 complete and 0 interrupted iterations
tenant_t00   [   0% ] 0325/0400 VUs  0h00m03.8s/1h0m10s  94.00 iters/s
tenant_t01   [   0% ] 0292/0400 VUs  0h00m03.8s/1h0m10s  94.00 iters/s
tenant_t02   [   0% ] 0324/0400 VUs  0h00m03.8s/1h0m10s  94.00 iters/s
tenant_t03   [   0% ] 0328/0400 VUs  0h00m03.8s/1h0m10s  94.00 iters/s
tenant_t04   [   0% ] 0025/0400 VUs  0h00m03.8s/1h0m10s  09.00 iters/s
tenant_t05   [   0% ] 0032/0400 VUs  0h00m03.8s/1h0m10s  09.00 iters/s
tenant_t06   [   0% ] 0030/0400 VUs  0h00m03.8s/1h0m10s  09.00 iters/s
tenant_t07   [   0% ] 0317/0400 VUs  0h00m03.8s/1h0m10s  94.00 iters/s

running (0h00m04.9s), 1783/3200 VUs, 137 complete and 0 interrupted iterations
tenant_t00   [   0% ] 0333/0400 VUs  0h00m04.9s/1h0m10s  94.00 iters/s
tenant_t01   [   0% ] 0338/0400 VUs  0h00m04.8s/1h0m10s  94.00 iters/s
tenant_t02   [   0% ] 0340/0400 VUs  0h00m04.9s/1h0m10s  94.00 iters/s
tenant_t03   [   0% ] 0335/0400 VUs  0h00m04.9s/1h0m10s  94.00 iters/s
tenant_t04   [   0% ] 0034/0400 VUs  0h00m04.9s/1h0m10s  09.00 iters/s
tenant_t05   [   0% ] 0036/0400 VUs  0h00m04.9s/1h0m10s  09.00 iters/s
tenant_t06   [   0% ] 0032/0400 VUs  0h00m04.9s/1h0m10s  09.00 iters/s
tenant_t07   [   0% ] 0335/0400 VUs  0h00m04.9s/1h0m10s  94.00 iters/s
time="2026-08-24T02:00:28+06:00" level=warning msg="Request Failed" error="Post \"http://127.0.0.1:30080/v1/tenants/t00/workloads/replay\": dial tcp 127.0.0.1:30080: connectex: A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond."

running (0h00m06.4s), 1839/3200 VUs, 173 complete and 0 interrupted iterations
tenant_t00   [   0% ] 0325/0400 VUs  0h00m06.3s/1h0m10s  94.00 iters/s
tenant_t01   [   0% ] 0355/0400 VUs  0h00m06.3s/1h0m10s  94.00 iters/s
tenant_t02   [   0% ] 0352/0400 VUs  0h00m06.4s/1h0m10s  94.00 iters/s
tenant_t03   [   0% ] 0331/0400 VUs  0h00m06.4s/1h0m10s  94.00 iters/s
tenant_t04   [   0% ] 0044/0400 VUs  0h00m06.4s/1h0m10s  09.00 iters/s
tenant_t05   [   0% ] 0047/0400 VUs  0h00m06.4s/1h0m10s  09.00 iters/s
tenant_t06   [   0% ] 0034/0400 VUs  0h00m06.4s/1h0m10s  09.00 iters/s
tenant_t07   [   0% ] 0351/0400 VUs  0h00m06.4s/1h0m10s  94.00 iters/s

running (0h00m06.8s), 1843/3200 VUs, 291 complete and 0 interrupted iterations
tenant_t00   [   0% ] 0305/0400 VUs  0h00m06.7s/1h0m10s  94.00 iters/s
tenant_t01   [   0% ] 0376/0400 VUs  0h00m06.7s/1h0m10s  94.00 iters/s
tenant_t02   [   0% ] 0360/0400 VUs  0h00m06.7s/1h0m10s  94.00 iters/s
tenant_t03   [   0% ] 0317/0400 VUs  0h00m06.7s/1h0m10s  94.00 iters/s
tenant_t04   [   0% ] 0045/0400 VUs  0h00m06.7s/1h0m10s  09.00 iters/s
tenant_t05   [   0% ] 0052/0400 VUs  0h00m06.7s/1h0m10s  09.00 iters/s
tenant_t06   [   0% ] 0046/0400 VUs  0h00m06.7s/1h0m10s  09.00 iters/s
tenant_t07   [   0% ] 0342/0400 VUs  0h00m06.7s/1h0m10s  94.00 iters/s

running (0h00m07.8s), 2334/3351 VUs, 389 complete and 0 interrupted iterations
tenant_t00   [   0% ] 0424/0424 VUs  0h00m07.7s/1h0m10s  94.00 iters/s
tenant_t01   [   0% ] 0436/0437 VUs  0h00m07.7s/1h0m10s  94.00 iters/s
tenant_t02   [   0% ] 0433/0433 VUs  0h00m07.8s/1h0m10s  94.00 iters/s
tenant_t03   [   0% ] 0425/0425 VUs  0h00m07.8s/1h0m10s  94.00 iters/s
tenant_t04   [   0% ] 0062/0400 VUs  0h00m07.7s/1h0m10s  09.00 iters/s
tenant_t05   [   0% ] 0062/0400 VUs  0h00m07.7s/1h0m10s  09.00 iters/s
tenant_t06   [   0% ] 0061/0400 VUs  0h00m07.7s/1h0m10s  09.00 iters/s
tenant_t07   [   0% ] 0431/0432 VUs  0h00m07.8s/1h0m10s  94.00 iters/s

running (0h00m08.8s), 2487/3480 VUs, 451 complete and 0 interrupted iterations
tenant_t00   [   0% ] 0450/0450 VUs  0h00m08.7s/1h0m10s  94.00 iters/s
tenant_t01   [   0% ] 0459/0461 VUs  0h00m08.7s/1h0m10s  94.00 iters/s
tenant_t02   [   0% ] 0460/0461 VUs  0h00m08.8s/1h0m10s  94.00 iters/s
tenant_t03   [   0% ] 0449/0450 VUs  0h00m08.7s/1h0m10s  94.00 iters/s
tenant_t04   [   0% ] 0071/0400 VUs  0h00m08.7s/1h0m10s  09.00 iters/s
tenant_t05   [   0% ] 0071/0400 VUs  0h00m08.7s/1h0m10s  09.00 iters/s
tenant_t06   [   0% ] 0069/0400 VUs  0h00m08.7s/1h0m10s  09.00 iters/s
tenant_t07   [   0% ] 0458/0458 VUs  0h00m08.7s/1h0m10s  94.00 iters/s

running (0h00m09.8s), 2681/3653 VUs, 554 complete and 0 interrupted iterations
tenant_t00   [   0% ] 0486/0486 VUs  0h00m09.7s/1h0m10s  94.00 iters/s
tenant_t01   [   0% ] 0493/0493 VUs  0h00m09.7s/1h0m10s  94.00 iters/s
tenant_t02   [   0% ] 0494/0495 VUs  0h00m09.8s/1h0m10s  94.00 iters/s
tenant_t03   [   0% ] 0485/0485 VUs  0h00m09.8s/1h0m10s  94.00 iters/s
tenant_t04   [   0% ] 0076/0400 VUs  0h00m09.7s/1h0m10s  09.00 iters/s
tenant_t05   [   0% ] 0078/0400 VUs  0h00m09.7s/1h0m10s  09.00 iters/s
tenant_t06   [   0% ] 0075/0400 VUs  0h00m09.7s/1h0m10s  09.00 iters/s
tenant_t07   [   0% ] 0494/0494 VUs  0h00m09.8s/1h0m10s  94.00 iters/s

running (0h00m10.8s), 2821/3776 VUs, 774 complete and 0 interrupted iterations
tenant_t00   [   0% ] 0507/0507 VUs  0h00m10.7s/1h0m10s  94.00 iters/s
tenant_t01   [   0% ] 0515/0518 VUs  0h00m10.7s/1h0m10s  88.46 iters/s
tenant_t02   [   0% ] 0523/0523 VUs  0h00m10.7s/1h0m10s  94.00 iters/s
tenant_t03   [   0% ] 0511/0511 VUs  0h00m10.7s/1h0m10s  94.00 iters/s
tenant_t04   [   0% ] 0082/0400 VUs  0h00m10.7s/1h0m10s  14.44 iters/s
tenant_t05   [   0% ] 0084/0400 VUs  0h00m10.7s/1h0m10s  09.00 iters/s
tenant_t06   [   0% ] 0082/0400 VUs  0h00m10.7s/1h0m10s  09.00 iters/s
tenant_t07   [   0% ] 0517/0517 VUs  0h00m10.7s/1h0m10s  94.00 iters/s

running (0h00m11.8s), 2834/3829 VUs, 1206 complete and 0 interrupted iterations
tenant_t00   [   0% ] 0519/0522 VUs  0h00m11.7s/1h0m10s  94.00 iters/s
tenant_t01   [   0% ] 0513/0525 VUs  0h00m11.7s/1h0m10s  79.98 iters/s
tenant_t02   [   0% ] 0524/0536 VUs  0h00m11.7s/1h0m10s  94.00 iters/s
tenant_t03   [   0% ] 0500/0522 VUs  0h00m11.7s/1h0m10s  94.00 iters/s
tenant_t04   [   0% ] 0094/0400 VUs  0h00m11.7s/1h0m10s  23.05 iters/s
tenant_t05   [   0% ] 0078/0400 VUs  0h00m11.7s/1h0m10s  09.00 iters/s
tenant_t06   [   0% ] 0086/0400 VUs  0h00m11.7s/1h0m10s  09.00 iters/s
tenant_t07   [   0% ] 0520/0524 VUs  0h00m11.7s/1h0m10s  94.00 iters/s

running (0h00m12.8s), 2765/3831 VUs, 1773 complete and 0 interrupted iterations
tenant_t00   [   0% ] 0515/0524 VUs  0h00m12.7s/1h0m10s  94.00 iters/s
tenant_t01   [   0% ] 0483/0525 VUs  0h00m12.7s/1h0m10s  71.33 iters/s
tenant_t02   [   0% ] 0504/0536 VUs  0h00m12.8s/1h0m10s  94.00 iters/s
tenant_t03   [   0% ] 0502/0522 VUs  0h00m12.8s/1h0m10s  94.00 iters/s
tenant_t04   [   0% ] 0106/0400 VUs  0h00m12.8s/1h0m10s  31.74 iters/s
tenant_t05   [   0% ] 0073/0400 VUs  0h00m12.7s/1h0m10s  09.00 iters/s
tenant_t06   [   0% ] 0081/0400 VUs  0h00m12.7s/1h0m10s  09.00 iters/s
tenant_t07   [   0% ] 0501/0524 VUs  0h00m12.8s/1h0m10s  94.00 iters/s

running (0h00m13.8s), 2838/3843 VUs, 2183 complete and 0 interrupted iterations
tenant_t00   [   0% ] 0518/0526 VUs  0h00m13.7s/1h0m10s  94.00 iters/s
tenant_t01   [   0% ] 0461/0525 VUs  0h00m13.7s/1h0m10s  62.97 iters/s
tenant_t02   [   0% ] 0528/0536 VUs  0h00m13.7s/1h0m10s  94.00 iters/s
tenant_t03   [   0% ] 0529/0532 VUs  0h00m13.7s/1h0m10s  94.00 iters/s
tenant_t04   [   0% ] 0133/0400 VUs  0h00m13.7s/1h0m10s  40.24 iters/s
tenant_t05   [   0% ] 0073/0400 VUs  0h00m13.7s/1h0m10s  09.00 iters/s
tenant_t06   [   0% ] 0079/0400 VUs  0h00m13.7s/1h0m10s  09.00 iters/s
tenant_t07   [   0% ] 0517/0524 VUs  0h00m13.7s/1h0m10s  94.00 iters/s

running (0h00m14.8s), 2810/3850 VUs, 2705 complete and 0 interrupted iterations
tenant_t00   [   0% ] 0520/0526 VUs  0h00m14.7s/1h0m10s  94.00 iters/s
tenant_t01   [   0% ] 0432/0525 VUs  0h00m14.7s/1h0m10s  54.43 iters/s
tenant_t02   [   0% ] 0522/0538 VUs  0h00m14.8s/1h0m10s  94.00 iters/s
tenant_t03   [   0% ] 0516/0536 VUs  0h00m14.8s/1h0m10s  94.00 iters/s
tenant_t04   [   0% ] 0167/0400 VUs  0h00m14.8s/1h0m10s  48.83 iters/s
tenant_t05   [   0% ] 0069/0400 VUs  0h00m14.7s/1h0m10s  09.00 iters/s
tenant_t06   [   0% ] 0073/0400 VUs  0h00m14.7s/1h0m10s  09.00 iters/s
tenant_t07   [   0% ] 0511/0525 VUs  0h00m14.8s/1h0m10s  94.00 iters/s

running (0h00m15.8s), 2714/3850 VUs, 3294 complete and 0 interrupted iterations
tenant_t00   [   0% ] 0504/0526 VUs  0h00m15.7s/1h0m10s  94.00 iters/s
tenant_t01   [   0% ] 0361/0525 VUs  0h00m15.7s/1h0m10s  45.96 iters/s
tenant_t02   [   0% ] 0512/0538 VUs  0h00m15.7s/1h0m10s  94.00 iters/s
tenant_t03   [   0% ] 0506/0536 VUs  0h00m15.7s/1h0m10s  94.00 iters/s
tenant_t04   [   0% ] 0194/0400 VUs  0h00m15.7s/1h0m10s  57.17 iters/s
tenant_t05   [   0% ] 0060/0400 VUs  0h00m15.7s/1h0m10s  09.00 iters/s
tenant_t06   [   0% ] 0066/0400 VUs  0h00m15.7s/1h0m10s  09.00 iters/s
tenant_t07   [   0% ] 0511/0525 VUs  0h00m15.7s/1h0m10s  94.00 iters/s

running (0h00m16.8s), 2534/3850 VUs, 3971 complete and 0 interrupted iterations
tenant_t00   [   0% ] 0475/0526 VUs  0h00m16.7s/1h0m10s  94.00 iters/s
tenant_t01   [   0% ] 0298/0525 VUs  0h00m16.7s/1h0m10s  37.62 iters/s
tenant_t02   [   0% ] 0487/0538 VUs  0h00m16.8s/1h0m10s  94.00 iters/s
tenant_t03   [   0% ] 0458/0536 VUs  0h00m16.8s/1h0m10s  94.00 iters/s
tenant_t04   [   0% ] 0230/0400 VUs  0h00m16.7s/1h0m10s  65.75 iters/s
tenant_t05   [   0% ] 0051/0400 VUs  0h00m16.7s/1h0m10s  09.00 iters/s
tenant_t06   [   0% ] 0057/0400 VUs  0h00m16.7s/1h0m10s  09.00 iters/s
tenant_t07   [   0% ] 0478/0525 VUs  0h00m16.8s/1h0m10s  94.00 iters/s

running (0h00m17.8s), 2461/3850 VUs, 4541 complete and 0 interrupted iterations
tenant_t00   [   0% ] 0461/0526 VUs  0h00m17.7s/1h0m10s  94.00 iters/s
tenant_t01   [   0% ] 0250/0525 VUs  0h00m17.7s/1h0m10s  28.94 iters/s
tenant_t02   [   0% ] 0472/0538 VUs  0h00m17.7s/1h0m10s  94.00 iters/s
tenant_t03   [   0% ] 0452/0536 VUs  0h00m17.7s/1h0m10s  94.00 iters/s
tenant_t04   [   0% ] 0264/0400 VUs  0h00m17.7s/1h0m10s  74.13 iters/s
tenant_t05   [   0% ] 0046/0400 VUs  0h00m17.7s/1h0m10s  09.00 iters/s
tenant_t06   [   0% ] 0053/0400 VUs  0h00m17.7s/1h0m10s  09.00 iters/s
tenant_t07   [   0% ] 0463/0525 VUs  0h00m17.7s/1h0m10s  94.00 iters/s

running (0h00m18.8s), 2195/3850 VUs, 5305 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0408/0526 VUs  0h00m18.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0179/0525 VUs  0h00m18.7s/1h0m10s  20.31 iters/s
tenant_t02   [   1% ] 0427/0538 VUs  0h00m18.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0404/0536 VUs  0h00m18.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0284/0400 VUs  0h00m18.7s/1h0m10s  82.70 iters/s
tenant_t05   [   1% ] 0040/0400 VUs  0h00m18.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0045/0400 VUs  0h00m18.7s/1h0m10s  09.00 iters/s
tenant_t07   [   1% ] 0408/0525 VUs  0h00m18.7s/1h0m10s  94.00 iters/s

running (0h00m19.8s), 2138/3850 VUs, 5859 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0395/0526 VUs  0h00m19.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0137/0525 VUs  0h00m19.7s/1h0m10s  11.85 iters/s
tenant_t02   [   1% ] 0413/0538 VUs  0h00m19.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0396/0536 VUs  0h00m19.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0309/0400 VUs  0h00m19.7s/1h0m10s  91.20 iters/s
tenant_t05   [   1% ] 0041/0400 VUs  0h00m19.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0044/0400 VUs  0h00m19.7s/1h0m10s  09.00 iters/s
tenant_t07   [   1% ] 0403/0525 VUs  0h00m19.7s/1h0m10s  94.00 iters/s

running (0h00m20.8s), 1942/3850 VUs, 6553 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0359/0526 VUs  0h00m20.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0088/0525 VUs  0h00m20.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0370/0538 VUs  0h00m20.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0374/0536 VUs  0h00m20.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0314/0400 VUs  0h00m20.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0037/0400 VUs  0h00m20.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0039/0400 VUs  0h00m20.7s/1h0m10s  15.01 iters/s
tenant_t07   [   1% ] 0361/0525 VUs  0h00m20.7s/1h0m10s  94.00 iters/s

running (0h00m21.8s), 1843/3850 VUs, 7158 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0343/0526 VUs  0h00m21.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0066/0525 VUs  0h00m21.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0347/0538 VUs  0h00m21.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0353/0536 VUs  0h00m21.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0323/0400 VUs  0h00m21.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0030/0400 VUs  0h00m21.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0041/0400 VUs  0h00m21.7s/1h0m10s  23.42 iters/s
tenant_t07   [   1% ] 0340/0525 VUs  0h00m21.7s/1h0m10s  94.00 iters/s

running (0h00m22.8s), 1691/3850 VUs, 7826 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0319/0526 VUs  0h00m22.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0041/0525 VUs  0h00m22.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0314/0538 VUs  0h00m22.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0316/0536 VUs  0h00m22.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0302/0400 VUs  0h00m22.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0031/0400 VUs  0h00m22.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0061/0400 VUs  0h00m22.7s/1h0m10s  32.01 iters/s
tenant_t07   [   1% ] 0307/0525 VUs  0h00m22.7s/1h0m10s  94.00 iters/s

running (0h00m23.8s), 1458/3850 VUs, 8584 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0271/0526 VUs  0h00m23.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0030/0525 VUs  0h00m23.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0268/0538 VUs  0h00m23.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0269/0536 VUs  0h00m23.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0249/0400 VUs  0h00m23.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0023/0400 VUs  0h00m23.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0081/0400 VUs  0h00m23.7s/1h0m10s  40.45 iters/s
tenant_t07   [   1% ] 0267/0525 VUs  0h00m23.7s/1h0m10s  94.00 iters/s

running (0h00m24.8s), 1489/3850 VUs, 9085 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0270/0526 VUs  0h00m24.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0030/0525 VUs  0h00m24.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0278/0538 VUs  0h00m24.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0265/0536 VUs  0h00m24.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0247/0400 VUs  0h00m24.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0027/0400 VUs  0h00m24.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0096/0400 VUs  0h00m24.7s/1h0m10s  48.83 iters/s
tenant_t07   [   1% ] 0276/0525 VUs  0h00m24.7s/1h0m10s  94.00 iters/s

running (0h00m25.8s), 1343/3850 VUs, 9772 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0227/0526 VUs  0h00m25.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0028/0525 VUs  0h00m25.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0257/0538 VUs  0h00m25.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0230/0536 VUs  0h00m25.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0219/0400 VUs  0h00m25.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0031/0400 VUs  0h00m25.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0116/0400 VUs  0h00m25.7s/1h0m10s  57.32 iters/s
tenant_t07   [   1% ] 0235/0525 VUs  0h00m25.7s/1h0m10s  94.00 iters/s

running (0h00m26.8s), 1082/3850 VUs, 10583 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0188/0526 VUs  0h00m26.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0018/0525 VUs  0h00m26.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0184/0538 VUs  0h00m26.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0189/0536 VUs  0h00m26.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0163/0400 VUs  0h00m26.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0027/0400 VUs  0h00m26.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0127/0400 VUs  0h00m26.7s/1h0m10s  65.87 iters/s
tenant_t07   [   1% ] 0186/0525 VUs  0h00m26.7s/1h0m10s  94.00 iters/s

running (0h00m27.8s), 0834/3850 VUs, 11389 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0140/0526 VUs  0h00m27.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0015/0525 VUs  0h00m27.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0145/0538 VUs  0h00m27.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0148/0536 VUs  0h00m27.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0120/0400 VUs  0h00m27.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0019/0400 VUs  0h00m27.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0103/0400 VUs  0h00m27.7s/1h0m10s  74.36 iters/s
tenant_t07   [   1% ] 0144/0525 VUs  0h00m27.7s/1h0m10s  94.00 iters/s

running (0h00m28.8s), 0739/3850 VUs, 12051 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0112/0526 VUs  0h00m28.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0014/0525 VUs  0h00m28.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0128/0538 VUs  0h00m28.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0123/0536 VUs  0h00m28.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0119/0400 VUs  0h00m28.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0017/0400 VUs  0h00m28.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0109/0400 VUs  0h00m28.7s/1h0m10s  82.90 iters/s
tenant_t07   [   1% ] 0117/0525 VUs  0h00m28.7s/1h0m10s  94.00 iters/s

running (0h00m29.8s), 0582/3850 VUs, 12783 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0093/0526 VUs  0h00m29.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0009/0525 VUs  0h00m29.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0088/0538 VUs  0h00m29.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0093/0536 VUs  0h00m29.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0101/0400 VUs  0h00m29.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0009/0400 VUs  0h00m29.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0098/0400 VUs  0h00m29.7s/1h0m10s  91.39 iters/s
tenant_t07   [   1% ] 0091/0525 VUs  0h00m29.7s/1h0m10s  94.00 iters/s

running (0h00m30.8s), 0123/3850 VUs, 13821 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0019/0526 VUs  0h00m30.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0001/0525 VUs  0h00m30.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0022/0538 VUs  0h00m30.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0018/0536 VUs  0h00m30.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0020/0400 VUs  0h00m30.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0002/0400 VUs  0h00m30.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0019/0400 VUs  0h00m30.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0022/0525 VUs  0h00m30.7s/1h0m10s  88.36 iters/s

running (0h00m31.8s), 0023/3850 VUs, 14498 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0005/0526 VUs  0h00m31.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m31.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0004/0538 VUs  0h00m31.8s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0005/0536 VUs  0h00m31.8s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0003/0400 VUs  0h00m31.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m31.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0004/0400 VUs  0h00m31.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0001/0525 VUs  0h00m31.8s/1h0m10s  79.87 iters/s

running (0h00m32.8s), 0005/3850 VUs, 15075 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0001/0526 VUs  0h00m32.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m32.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0001/0538 VUs  0h00m32.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0000/0536 VUs  0h00m32.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0001/0400 VUs  0h00m32.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m32.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0000/0400 VUs  0h00m32.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0001/0525 VUs  0h00m32.7s/1h0m10s  71.33 iters/s

running (0h00m33.8s), 0004/3850 VUs, 15631 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0000/0526 VUs  0h00m33.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m33.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0000/0538 VUs  0h00m33.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0000/0536 VUs  0h00m33.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0000/0400 VUs  0h00m33.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m33.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0001/0400 VUs  0h00m33.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0001/0525 VUs  0h00m33.7s/1h0m10s  62.84 iters/s

running (0h00m34.8s), 0003/3850 VUs, 16178 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0000/0526 VUs  0h00m34.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m34.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0001/0538 VUs  0h00m34.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0001/0536 VUs  0h00m34.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0000/0400 VUs  0h00m34.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m34.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0000/0400 VUs  0h00m34.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m34.7s/1h0m10s  54.43 iters/s

running (0h00m35.8s), 0003/3850 VUs, 16716 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0001/0526 VUs  0h00m35.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m35.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0001/0538 VUs  0h00m35.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0000/0536 VUs  0h00m35.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0000/0400 VUs  0h00m35.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m35.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0000/0400 VUs  0h00m35.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m35.7s/1h0m10s  45.96 iters/s

running (0h00m36.8s), 0002/3850 VUs, 17247 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0000/0526 VUs  0h00m36.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m36.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0001/0538 VUs  0h00m36.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0000/0536 VUs  0h00m36.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0000/0400 VUs  0h00m36.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m36.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0000/0400 VUs  0h00m36.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m36.7s/1h0m10s  37.40 iters/s

running (0h00m37.8s), 0004/3850 VUs, 17766 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0001/0526 VUs  0h00m37.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m37.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0001/0538 VUs  0h00m37.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0000/0536 VUs  0h00m37.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0001/0400 VUs  0h00m37.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m37.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0000/0400 VUs  0h00m37.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m37.7s/1h0m10s  28.94 iters/s

running (0h00m38.8s), 0004/3850 VUs, 18279 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0001/0526 VUs  0h00m38.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m38.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0001/0538 VUs  0h00m38.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0001/0536 VUs  0h00m38.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0000/0400 VUs  0h00m38.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m38.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0000/0400 VUs  0h00m38.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m38.7s/1h0m10s  20.31 iters/s

running (0h00m39.8s), 0003/3850 VUs, 18784 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0001/0526 VUs  0h00m39.7s/1h0m10s  94.00 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m39.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0001/0538 VUs  0h00m39.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0000/0536 VUs  0h00m39.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0000/0400 VUs  0h00m39.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m39.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0000/0400 VUs  0h00m39.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m39.7s/1h0m10s  11.85 iters/s

running (0h00m40.8s), 0001/3850 VUs, 19281 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0000/0526 VUs  0h00m40.7s/1h0m10s  88.46 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m40.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0000/0538 VUs  0h00m40.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0000/0536 VUs  0h00m40.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0000/0400 VUs  0h00m40.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m40.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0000/0400 VUs  0h00m40.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m40.7s/1h0m10s  09.00 iters/s

running (0h00m41.8s), 0002/3850 VUs, 19767 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0000/0526 VUs  0h00m41.7s/1h0m10s  79.98 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m41.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0001/0538 VUs  0h00m41.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0000/0536 VUs  0h00m41.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0000/0400 VUs  0h00m41.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m41.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0000/0400 VUs  0h00m41.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m41.7s/1h0m10s  09.00 iters/s

running (0h00m42.8s), 0002/3850 VUs, 20246 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0000/0526 VUs  0h00m42.7s/1h0m10s  71.45 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m42.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0001/0538 VUs  0h00m42.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0000/0536 VUs  0h00m42.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0000/0400 VUs  0h00m42.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m42.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0000/0400 VUs  0h00m42.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m42.7s/1h0m10s  09.00 iters/s

running (0h00m43.8s), 0002/3850 VUs, 20716 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0000/0526 VUs  0h00m43.7s/1h0m10s  62.97 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m43.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0001/0538 VUs  0h00m43.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0000/0536 VUs  0h00m43.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0000/0400 VUs  0h00m43.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m43.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0000/0400 VUs  0h00m43.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m43.7s/1h0m10s  09.00 iters/s

running (0h00m44.8s), 0001/3850 VUs, 21179 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0000/0526 VUs  0h00m44.7s/1h0m10s  54.43 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m44.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0000/0538 VUs  0h00m44.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0000/0536 VUs  0h00m44.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0000/0400 VUs  0h00m44.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m44.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0000/0400 VUs  0h00m44.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m44.7s/1h0m10s  09.00 iters/s

running (0h00m45.8s), 0005/3850 VUs, 21628 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0000/0526 VUs  0h00m45.7s/1h0m10s  45.96 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m45.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0001/0538 VUs  0h00m45.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0001/0536 VUs  0h00m45.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0001/0400 VUs  0h00m45.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m45.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0001/0400 VUs  0h00m45.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m45.7s/1h0m10s  09.00 iters/s

running (0h00m46.8s), 0004/3850 VUs, 22074 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0001/0526 VUs  0h00m46.7s/1h0m10s  37.40 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m46.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0001/0538 VUs  0h00m46.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0001/0536 VUs  0h00m46.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0000/0400 VUs  0h00m46.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m46.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0000/0400 VUs  0h00m46.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m46.7s/1h0m10s  09.00 iters/s

running (0h00m47.8s), 0003/3850 VUs, 22511 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0000/0526 VUs  0h00m47.7s/1h0m10s  28.94 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m47.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0001/0538 VUs  0h00m47.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0001/0536 VUs  0h00m47.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0000/0400 VUs  0h00m47.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m47.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0000/0400 VUs  0h00m47.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m47.7s/1h0m10s  09.00 iters/s

running (0h00m48.8s), 0032/3850 VUs, 22910 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0002/0526 VUs  0h00m48.7s/1h0m10s  20.31 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m48.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0007/0538 VUs  0h00m48.8s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0009/0536 VUs  0h00m48.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0007/0400 VUs  0h00m48.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m48.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0006/0400 VUs  0h00m48.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m48.8s/1h0m10s  09.00 iters/s

running (0h00m49.8s), 0003/3850 VUs, 23358 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0000/0526 VUs  0h00m49.7s/1h0m10s  11.85 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m49.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0001/0538 VUs  0h00m49.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0001/0536 VUs  0h00m49.7s/1h0m10s  94.00 iters/s
tenant_t04   [   1% ] 0000/0400 VUs  0h00m49.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m49.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0000/0400 VUs  0h00m49.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m49.7s/1h0m10s  09.00 iters/s

running (0h00m50.8s), 0002/3850 VUs, 23769 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0000/0526 VUs  0h00m50.7s/1h0m10s  09.00 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m50.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0001/0538 VUs  0h00m50.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0000/0536 VUs  0h00m50.7s/1h0m10s  88.36 iters/s
tenant_t04   [   1% ] 0000/0400 VUs  0h00m50.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m50.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0000/0400 VUs  0h00m50.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m50.7s/1h0m10s  09.00 iters/s

running (0h00m51.8s), 0002/3850 VUs, 24171 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0000/0526 VUs  0h00m51.7s/1h0m10s  09.00 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m51.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0001/0538 VUs  0h00m51.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0000/0536 VUs  0h00m51.7s/1h0m10s  79.87 iters/s
tenant_t04   [   1% ] 0000/0400 VUs  0h00m51.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m51.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0000/0400 VUs  0h00m51.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m51.7s/1h0m10s  09.00 iters/s

running (0h00m52.8s), 0001/3850 VUs, 24566 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0000/0526 VUs  0h00m52.7s/1h0m10s  09.00 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m52.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0000/0538 VUs  0h00m52.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0000/0536 VUs  0h00m52.7s/1h0m10s  71.33 iters/s
tenant_t04   [   1% ] 0000/0400 VUs  0h00m52.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m52.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0000/0400 VUs  0h00m52.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m52.7s/1h0m10s  09.00 iters/s

running (0h00m53.8s), 0002/3850 VUs, 24950 complete and 0 interrupted iterations
tenant_t00   [   1% ] 0000/0526 VUs  0h00m53.7s/1h0m10s  09.00 iters/s
tenant_t01   [   1% ] 0000/0525 VUs  0h00m53.7s/1h0m10s  09.00 iters/s
tenant_t02   [   1% ] 0001/0538 VUs  0h00m53.7s/1h0m10s  94.00 iters/s
tenant_t03   [   1% ] 0000/0536 VUs  0h00m53.7s/1h0m10s  62.84 iters/s
tenant_t04   [   1% ] 0000/0400 VUs  0h00m53.7s/1h0m10s  94.00 iters/s
tenant_t05   [   1% ] 0001/0400 VUs  0h00m53.7s/1h0m10s  09.00 iters/s
tenant_t06   [   1% ] 0000/0400 VUs  0h00m53.7s/1h0m10s  94.00 iters/s
tenant_t07   [   1% ] 0000/0525 VUs  0h00m53.7s/1h0m10s  09.00 iters/s

running (0h00m54.8s), 0003/3850 VUs, 25326 complete and 0 interrupted iterations
tenant_t00   [   2% ] 0000/0526 VUs  0h00m54.7s/1h0m10s  09.00 iters/s
tenant_t01   [   2% ] 0000/0525 VUs  0h00m54.7s/1h0m10s  09.00 iters/s
tenant_t02   [   2% ] 0001/0538 VUs  0h00m54.7s/1h0m10s  94.00 iters/s
tenant_t03   [   2% ] 0001/0536 VUs  0h00m54.7s/1h0m10s  54.27 iters/s
tenant_t04   [   2% ] 0000/0400 VUs  0h00m54.7s/1h0m10s  94.00 iters/s
tenant_t05   [   2% ] 0001/0400 VUs  0h00m54.7s/1h0m10s  09.00 iters/s
tenant_t06   [   2% ] 0000/0400 VUs  0h00m54.7s/1h0m10s  94.00 iters/s
tenant_t07   [   2% ] 0000/0525 VUs  0h00m54.7s/1h0m10s  09.00 iters/s

running (0h00m55.8s), 0004/3850 VUs, 25693 complete and 0 interrupted iterations
tenant_t00   [   2% ] 0000/0526 VUs  0h00m55.7s/1h0m10s  09.00 iters/s
tenant_t01   [   2% ] 0000/0525 VUs  0h00m55.7s/1h0m10s  09.00 iters/s
tenant_t02   [   2% ] 0001/0538 VUs  0h00m55.7s/1h0m10s  94.00 iters/s
tenant_t03   [   2% ] 0001/0536 VUs  0h00m55.7s/1h0m10s  45.78 iters/s
tenant_t04   [   2% ] 0001/0400 VUs  0h00m55.7s/1h0m10s  94.00 iters/s
tenant_t05   [   2% ] 0001/0400 VUs  0h00m55.7s/1h0m10s  09.00 iters/s
tenant_t06   [   2% ] 0000/0400 VUs  0h00m55.7s/1h0m10s  94.00 iters/s
tenant_t07   [   2% ] 0000/0525 VUs  0h00m55.7s/1h0m10s  09.00 iters/s

running (0h00m56.8s), 0001/3850 VUs, 26055 complete and 0 interrupted iterations
tenant_t00   [   2% ] 0000/0526 VUs  0h00m56.7s/1h0m10s  09.00 iters/s
tenant_t01   [   2% ] 0000/0525 VUs  0h00m56.7s/1h0m10s  09.00 iters/s
tenant_t02   [   2% ] 0000/0538 VUs  0h00m56.7s/1h0m10s  94.00 iters/s
tenant_t03   [   2% ] 0000/0536 VUs  0h00m56.7s/1h0m10s  37.40 iters/s
tenant_t04   [   2% ] 0000/0400 VUs  0h00m56.7s/1h0m10s  94.00 iters/s
tenant_t05   [   2% ] 0001/0400 VUs  0h00m56.7s/1h0m10s  09.00 iters/s
tenant_t06   [   2% ] 0000/0400 VUs  0h00m56.7s/1h0m10s  94.00 iters/s
tenant_t07   [   2% ] 0000/0525 VUs  0h00m56.7s/1h0m10s  09.00 iters/s

running (0h00m57.8s), 0002/3850 VUs, 26405 complete and 0 interrupted iterations
tenant_t00   [   2% ] 0000/0526 VUs  0h00m57.7s/1h0m10s  09.00 iters/s
tenant_t01   [   2% ] 0000/0525 VUs  0h00m57.7s/1h0m10s  09.00 iters/s
tenant_t02   [   2% ] 0001/0538 VUs  0h00m57.7s/1h0m10s  94.00 iters/s
tenant_t03   [   2% ] 0000/0536 VUs  0h00m57.7s/1h0m10s  28.94 iters/s
tenant_t04   [   2% ] 0000/0400 VUs  0h00m57.7s/1h0m10s  94.00 iters/s
tenant_t05   [   2% ] 0001/0400 VUs  0h00m57.7s/1h0m10s  09.00 iters/s
tenant_t06   [   2% ] 0000/0400 VUs  0h00m57.7s/1h0m10s  94.00 iters/s
tenant_t07   [   2% ] 0000/0525 VUs  0h00m57.7s/1h0m10s  09.00 iters/s

running (0h00m58.8s), 0001/3850 VUs, 26749 complete and 0 interrupted iterations
tenant_t00   [   2% ] 0000/0526 VUs  0h00m58.7s/1h0m10s  09.00 iters/s
tenant_t01   [   2% ] 0000/0525 VUs  0h00m58.7s/1h0m10s  09.00 iters/s
tenant_t02   [   2% ] 0000/0538 VUs  0h00m58.7s/1h0m10s  94.00 iters/s
tenant_t03   [   2% ] 0000/0536 VUs  0h00m58.7s/1h0m10s  20.31 iters/s
tenant_t04   [   2% ] 0000/0400 VUs  0h00m58.7s/1h0m10s  94.00 iters/s
tenant_t05   [   2% ] 0001/0400 VUs  0h00m58.7s/1h0m10s  09.00 iters/s
tenant_t06   [   2% ] 0000/0400 VUs  0h00m58.7s/1h0m10s  94.00 iters/s
tenant_t07   [   2% ] 0000/0525 VUs  0h00m58.7s/1h0m10s  09.00 iters/s

running (0h00m59.8s), 0002/3850 VUs, 27082 complete and 0 interrupted iterations
tenant_t00   [   2% ] 0000/0526 VUs  0h00m59.7s/1h0m10s  09.00 iters/s
tenant_t01   [   2% ] 0000/0525 VUs  0h00m59.7s/1h0m10s  09.00 iters/s
tenant_t02   [   2% ] 0001/0538 VUs  0h00m59.7s/1h0m10s  94.00 iters/s
tenant_t03   [   2% ] 0000/0536 VUs  0h00m59.7s/1h0m10s  11.85 iters/s
tenant_t04   [   2% ] 0000/0400 VUs  0h00m59.7s/1h0m10s  94.00 iters/s
tenant_t05   [   2% ] 0001/0400 VUs  0h00m59.7s/1h0m10s  09.00 iters/s
tenant_t06   [   2% ] 0000/0400 VUs  0h00m59.7s/1h0m10s  94.00 iters/s
tenant_t07   [   2% ] 0000/0525 VUs  0h00m59.7s/1h0m10s  09.00 iters/s

running (0h01m00.8s), 0002/3850 VUs, 27408 complete and 0 interrupted iterations
tenant_t00   [   2% ] 0000/0526 VUs  0h01m00.7s/1h0m10s  09.00 iters/s
tenant_t01   [   2% ] 0000/0525 VUs  0h01m00.7s/1h0m10s  09.00 iters/s
tenant_t02   [   2% ] 0000/0538 VUs  0h01m00.7s/1h0m10s  88.36 iters/s
tenant_t03   [   2% ] 0001/0536 VUs  0h01m00.7s/1h0m10s  09.00 iters/s
tenant_t04   [   2% ] 0000/0400 VUs  0h01m00.7s/1h0m10s  94.00 iters/s
tenant_t05   [   2% ] 0001/0400 VUs  0h01m00.7s/1h0m10s  09.00 iters/s
tenant_t06   [   2% ] 0000/0400 VUs  0h01m00.7s/1h0m10s  94.00 iters/s
tenant_t07   [   2% ] 0000/0525 VUs  0h01m00.7s/1h0m10s  09.00 iters/s


  █ THRESHOLDS 

    dropped_iterations
    ✗ 'count<1' count=1773

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=2.01s min=0s     med=127.9ms  max=14.31s p(90)=6.05s p(95)=8.12s
      { expected_response:true }...: avg=2.01s min=2.06ms med=128.18ms max=14.31s p(90)=6.05s p(95)=8.12s
    http_req_failed................: 0.00%  1 out of 27414
    http_reqs......................: 27414  450.925218/s

    EXECUTION
    dropped_iterations.............: 1773   29.163581/s
    iteration_duration.............: avg=2.03s min=2.84ms med=128.49ms max=14.31s p(90)=6.1s  p(95)=8.33s
    iterations.....................: 27414  450.925218/s
    vus............................: 2      min=0          max=2838
    vus_max........................: 3850   min=1250       max=3850

    NETWORK
    data_received..................: 11 MB  181 kB/s
    data_sent......................: 7.7 MB 126 kB/s



running (0h01m00.8s), 0000/3850 VUs, 27413 complete and 4 interrupted iterations
tenant_t00 ✗ [   2% ] 0001/0526 VUs  0h01m00.7s/1h0m10s  09.00 iters/s
tenant_t01 ✗ [   2% ] 0001/0525 VUs  0h01m00.7s/1h0m10s  09.00 iters/s
tenant_t02 ✗ [   2% ] 0000/0538 VUs  0h01m00.8s/1h0m10s  88.26 iters/s
tenant_t03 ✗ [   2% ] 0001/0536 VUs  0h01m00.8s/1h0m10s  09.00 iters/s
tenant_t04 ✗ [   2% ] 0000/0400 VUs  0h01m00.8s/1h0m10s  94.00 iters/s
tenant_t05 ✗ [   2% ] 0000/0400 VUs  0h01m00.7s/1h0m10s  09.00 iters/s
tenant_t06 ✗ [   2% ] 0001/0400 VUs  0h01m00.7s/1h0m10s  94.00 iters/s
tenant_t07 ✗ [   2% ] 0000/0525 VUs  0h01m00.8s/1h0m10s  09.00 iters/s
time="2026-08-24T02:01:24+06:00" level=error msg="thresholds on metrics 'dropped_iterations' were crossed; at least one has abortOnFail enabled, stopping test prematurely"